{
	"lastBuildDate":"Thu, 26 Jan 2023 15:17:40 +0900",
	"total":823,
	"start":1,
	"display":20,
	"items":[
		{
			"title":"혼자 공부하는 파이썬 (1:1 과외하듯 배우는 프로그래밍 자습서)",
			"link":"https://search.shopping.naver.com/book/catalog/32507605957",
			"image":"https://shopping-phinf.pstatic.net/main_3250760/32507605957.20221019133018.jpg",
			"author":"윤인성",
			"discount":"19800",
			"publisher":"한빛미디어",
			"pubdate":"20220601",
			"isbn":"9791162245651",
			"description":"『혼자 공부하는 파이썬』이 더욱 흥미있고 알찬 내용으로 개정되었습니다. 프로그래밍이 정말 처음인 입문자도 따라갈 수 있는 친절한 설명과 단계별 학습은 그대로! 혼자 공부하더라도 체계적으로 계획을 세워 학습할 수 있도록 ‘혼공 계획표’를 새롭게 추가했습니다. 또한 입문자가 자주 물어보는 질문과 오류 해결 방법을 적재적소에 배치하여 예상치 못한 문제에 부딪혀도 좌절하지 않고 끝까지 완독할 수 있도록 도와줍니다. 단순한 문법 암기와 코딩 따라하기에 지쳤다면, 새로운 혼공파와 함께 ‘누적 예제’와 ‘도전 문제’로 프로그래밍의 신세계를 경험해 보세요! 배운 내용을 씹고 뜯고 맛보고 즐기다 보면 응용력은 물론 알고리즘 사고력까지 키워 코딩 실력이 쑥쑥 성장할 것입니다.혼자 해도 충분하다! 1:1 과외하듯 배우는 파이썬 프로그래밍 자습서이 책은 독학으로 파이썬을 배우는 입문자가 ‘꼭 필요한 내용을 제대로 학습’할 수 있도록 구성했습니다. 뭘 모르는지조차 모르는 입문자의 막연한 마음에 십분 공감하여 과외 선생님이 알려주듯 친절하게, 핵심적인 내용만 콕콕 집어줍니다. 책의 첫 페이지를 펼쳐서 마지막 페이지를 덮을 때까지, 혼자서도 충분히 파이썬을 배울 수 있다는 자신감과 확신이 계속될 것입니다!베타리더 검증으로, ‘함께 만든’ 입문자 맞춤형 도서베타리더와 함께 입문자에게 맞는 난이도, 분량, 학습 요소 등을 적극 반영했습니다. 어려운 용어와 개념은 한 번 더 풀어쓰고, 복잡한 설명은 눈에 잘 들어오는 그림으로 풀어냈습니다. ‘혼자 공부해 본’ 여러 입문자의 초심과 눈높이가 책 곳곳에 반영된 것이 이 책의 가장 큰 장점입니다."
		},
		{
			"title":"파이썬과 40개의 작품들 (자동화, 크롤링, 이미지처리, 데이터분석, 웹페이지, GUI 프로그램, 게임)",
			"link":"https://search.shopping.naver.com/book/catalog/32472041705",
			"image":"https://shopping-phinf.pstatic.net/main_3247204/32472041705.20221019105332.jpg",
			"author":"장문철",
			"discount":"16920",
			"publisher":"앤써북",
			"pubdate":"20220228",
			"isbn":"9791185553931",
			"description":"이 책은 내 업무와 생활에 바로 적용할 수 있는 40개의 프로그램을 직접 코딩해서 만들어보고, 동시에 파이썬을 자연스럽게 이해할 수 있게 구성하였다!파이썬 기초 문법 떼고 자동화, 크롤링, 이미지처리, 데이터분석, 웹페이지, GUI 프로그램, 게임, 인공지능 관련 40개 프로그램 직접 파이썬 코딩하며 만들어 본다.  이 책은 파이썬 기초 문법을 익힌 후 총 40개의 주제별 프로그램을 직접 코딩하며 만들어볼 수 있도록 구성하였다."
		},
		{
			"title":"Do it! 알고리즘 코딩 테스트: 파이썬 편 (코딩 테스트를 처음 준비하는 취준생의 필독서!)",
			"link":"https://search.shopping.naver.com/book/catalog/33938438618",
			"image":"https://shopping-phinf.pstatic.net/main_3393843/33938438618.20230117163208.jpg",
			"author":"김종관",
			"discount":"28800",
			"publisher":"이지스퍼블리싱",
			"pubdate":"20220816",
			"isbn":"9791163033936",
			"description":"기출 유형 분석부터 문제 풀이 비법까지코딩 테스트를 처음 준비하는 IT 기업 취준생의 필독서!“코딩 테스트를 제대로 준비하려면 어떤 문제를 얼마나 풀어야 할까?” 곧 코딩 테스트를 앞둔 취업 또는 이직 준비생이라면 누구나 이런 고민을 할 것이다. 《Do it! 알고리즘 코딩 테스트 - 파이썬 편》에 그 답이 있다. 네이버, 카카오, 삼성, 라인 등 주요 IT 기업의 시험에 나오는 알고리즘 내용이 모두 담겨 있어 책 한 권만으로 코딩 테스트 합격에 필요한 지식을 충분히 공부할 수 있다. 책에 수록된 알고리즘 문제 100개는 모두 최신 기출 유형을 반영하고 있어서 이 책의 문제만 다 풀면 당장 코딩 테스트를 볼 수 있는 수준까지 실력을 갖출 수 있다. 모든 문제는 ‘분석, 전략, 슈도코드, 코드 구현’까지 총 4단계를 거쳐 푸는데, 이렇게 문제를 푸는 습관까지 자기 것으로 만든다면 진짜 시험에서 어떤 문제를 만나든 실수 없이 해결할 수 있을 것이다."
		},
		{
			"title":"Do it! 게임 10개 만들며 배우는 파이썬 (누구나 이 책으로 파이썬 레벨 업!)",
			"link":"https://search.shopping.naver.com/book/catalog/36361929626",
			"image":"https://shopping-phinf.pstatic.net/main_3636192/36361929626.20221213162907.jpg",
			"author":"벤 포터^쉬무엘 포터",
			"discount":"19800",
			"publisher":"이지스퍼블리싱",
			"pubdate":"20221215",
			"isbn":"9791163034230",
			"description":"간단한 게임부터 텍스트 RPG 게임, 그래픽 레이싱 게임까지 완성하며 나의 파이썬 코딩 실력을 레벨 업 해보자동전 던지기나 가위바위보와 같은 간단한 게임부터 그래픽을 이용한 레이싱 게임까지 게임 10가지와 다른 여러 게임을 완성해 보면서 파이썬 문법과 프로그래밍을 배울 수 있습니다. 이 책은 실습 예제 113개를 제공하는 등 이론보다 실습 위주로 구성했습니다. 1~24장까지 프로그램을 완성하는 코드를 작성한 뒤, 하나하나 설명하여 독자들이 파이썬 문법뿐만 아니라 프로그래밍 원리를 자연스럽게 체득할 수 있도록 돕습니다.또한 파이썬 기본 함수와 클래스, 딕셔너리, 라이브러리 등을 소개하고 활용해 볼 수 있도록 했습니다. 단위 테스트, 디버깅, 코드 최적화와 외부화, 리팩터링 등 코드를 관리하는 기술까지 익혀 ‘진짜’ 프로그래머가 되는 길로 안내합니다. 이런 게임과 프로그램을 만들 수 있어요!ㆍ 채운 단어에 따라 이야기가 만들어지는 단어 채우기 게임을 만들 수 있어요.ㆍ 동전 던지기 게임과 주사위 던지기 게임으로 선택이나 무작위 숫자를 얻을 수 있어요. ㆍ 생일을 계산해 태어난 요일을 알아맞히는 계산 게임을 만들 수 있어요.ㆍ 컴퓨터와 가위! 바위! 보! 대결을 할 수 있어요.ㆍ 나만의 게임에서 메시지를 암호화할 수 있어요.  ㆍ 스무고개를 하듯 숫자를 맞히는 게임을 만들 수 있어요. ㆍ ‘행맨’ 게임으로 알려진 단어 맞히기 게임을 기획부터 개발까지 모두 할 수 있어요. ㆍ 우주를 배경으로 한 텍스트 RPG 게임을 만들 수 있어요. ㆍ 복잡한 도로에서 마주 오는 다른 차를 피하는 레이싱 게임을 만들 수 있어요. ㆍ 그 밖에 내 생일이 얼마나 남았는지 알 수 있는 카운트다운 프로그램, 팁을 계산하기 위한 서비스 팁 계산기, 웹 사이트 비밀번호를 만들기 위한 비밀번호 생성기까지 다양한 프로그램을 만들 수 있어요."
		},
		{
			"title":"혼자 공부하는 데이터 분석 with 파이썬 (1:1 과외하듯 배우는 데이터 분석 자습서)",
			"link":"https://search.shopping.naver.com/book/catalog/36555425618",
			"image":"https://shopping-phinf.pstatic.net/main_3655542/36555425618.20230103163017.jpg",
			"author":"박해선",
			"discount":"23400",
			"publisher":"한빛미디어",
			"pubdate":"20230102",
			"isbn":"9791169210287",
			"description":"혼자 해도 충분하다! 1:1 과외하듯 배우는 데이터 분석 자습서이 책은 독학으로 데이터 분석을 배우는 입문자가 ‘꼭 필요한 내용을 제대로 학습’할 수 있도록 구성했습니다. 뭘 모르는지조차 모르는 입문자의 막연한 마음에 십분 공감하여 과외 선생님이 알려주듯 친절하게, 핵심적인 내용만 콕콕 집어 줍니다. 책의 첫 페이지를 펼쳐서 마지막 페이지를 덮을 때까지, 혼자서도 충분히 데이터 분석을 배울 수 있다는 자신감과 확신이 계속될 것입니다!베타리더 검증으로, ‘함께 만든’ 입문자 맞춤형 도서베타리더와 함께 입문자에게 맞는 난이도, 분량, 학습 요소 등을 고민하고 이를 적극 반영했습니다. 어려운 용어와 개념은 한 번 더 풀어쓰고, 복잡한 설명은 눈에 잘 들어오는 그림으로 풀어냈습니다. ‘혼자 공부해 본’ 여러 입문자의 초심과 눈높이가 책 곳곳에 반영된 것이 이 책의 가장 큰 장점입니다.누구를 위한 책인가요?●t데이터 분석을 어떻게 시작할지 막막한 비전공자●t파이썬을 배운 다음 의미 있는 실습을 해 보고 싶은 파이썬 입문자●t프로그래밍은 알지만, 분석(통계)에 대한 이해가 필요한 개발자●t데이터에서 유의미한 결과를 도출해 이를 기획이나 마케팅에 적용해 보고 싶은 직장인●t데이터 분석가, 데이터 사이언티스트라는 직업에 관심 있는 모든 사람"
		},
		{
			"title":"Do it! 점프 투 파이썬 (이미 200만명이 이 책으로 프로그래밍을 시작했다!)",
			"link":"https://search.shopping.naver.com/book/catalog/32456895000",
			"image":"https://shopping-phinf.pstatic.net/main_3245689/32456895000.20230117163337.jpg",
			"author":"박응용",
			"discount":"16920",
			"publisher":"이지스퍼블리싱",
			"pubdate":"20190620",
			"isbn":"9791163030911",
			"description":"파이썬 4년 연속 베스트셀러 1위!《Do it! 점프 투 파이썬》 전면 개정판 출시!문과생도 중고등학생도 직장인도 프로그래밍에 눈뜨게 만든 바로 그 책이 전면 개정판으로 새로 태어났다! 2016년 《Do it! 점프 투 파이썬》으로 출간되었던 이 책은 약 4년 동안의 피드백을 반영하여 초보자가 더 빠르게 입문하고, 더 깊이 있게 공부할 수 있도록 개정되었다. 특히 ‘나 혼자 코딩’과 ‘코딩 면허 시험 20제’ 등 독자의 학습 흐름에 맞게 문제를 보강한 점이 눈에 띈다. 실습량도 두 배로 늘었다.4년 동안 압도적 1위! 위키독스 누적 방문 200만! 수많은 대학 및 학원의 교재 채택 등! 검증은 이미 끝났다. 코딩을 처음 배우는 중고등학생부터 나만의 경쟁력이 필요한 문과생, 데이터 분석과 인공지능/머신러닝으로 커리어를 뻗어 나가고 싶은 직장인까지! 프로그래밍의 세계에 풍덩 빠져 보자."
		},
		{
			"title":"파이썬 머신러닝 완벽 가이드 (다양한 캐글 예제와 함께 기초 알고리즘부터 최신 기법까지 배우는)",
			"link":"https://search.shopping.naver.com/book/catalog/32485894885",
			"image":"https://shopping-phinf.pstatic.net/main_3248589/32485894885.20221019134634.jpg",
			"author":"권철민",
			"discount":"36000",
			"publisher":"위키북스",
			"pubdate":"20220421",
			"isbn":"9791158393229",
			"description":"자세한 이론 설명과 파이썬 실습을 통해 머신러닝을 완벽하게 배울 수 있습니다!《파이썬 머신러닝 완벽 가이드》는 이론 위주의 머신러닝 책에서 탈피해, 다양한 실전 예제를 직접 구현해 보면서 머신러닝을 체득할 수 있도록 만들었습니다. 캐글과 UCI 머신러닝 리포지토리에서 난이도가 있는 실습 데이터를 기반으로 실전 예제를 구성했고, XGBoost, LightGBM, 스태킹 기법 등 캐글의 많은 데이터 사이언스에서 애용하는 최신 알고리즘과 기법을 상세하게 설명했습니다.이번 개정2판에서는 최신 사이킷런 버전(1.0.2)을 포함해 책에서 사용되는 모든 라이브러리를 최신 버전으로 업그레이드한 실습 코드를 구현하고, 다양한 유형의 하이퍼파라미터를 가지는 XGBoost나 LightGBM 모델의 최적 하이퍼파라미터 튜닝을 위한 베이지안 최적화 기법 적용 실습을 제공합니다. 또한 머신러닝 관련 데이터 분석에 널리 쓰이는 시각화 라이브러리인 matplotlib과 seaborn의 활용법을 다룬 장을 새롭게 추가했습니다."
		},
		{
			"title":"파이썬 알고리즘 인터뷰 (95가지 알고리즘 문제 풀이로 완성하는 코딩 테스트, 2021 세종도서 학술부문)",
			"link":"https://search.shopping.naver.com/book/catalog/32456486633",
			"image":"https://shopping-phinf.pstatic.net/main_3245648/32456486633.20230121071549.jpg",
			"author":"박상길",
			"discount":"34200",
			"publisher":"책만",
			"pubdate":"20200715",
			"isbn":"9791189909178",
			"description":"코딩 테스트와 인터뷰를 준비하는 취준생과 이직자를 위한 알고리즘 문제 풀이 완벽 마스터!세계 최고 온라인 문제 풀이 사이트인 리트코드(LeetCode)의 기출문제 풀이와 분석! 200여 개가 넘는 일러스트를 통해 알고리즘과 자료구조 이론을 한눈에 쉽게 익힐 수 있음은 물론, 파이썬으로 구현하는 코드 풀이를 통해 성능 최적화 기법, 파이썬의 핵심 문법과 다양한 실용 테크닉까지 배울 수 있는, 초보 개발자와 숙련 개발자 모두를 위한 책이다.마이크로소프트와 구글을 필두로 전 세계 개발자 채용의 첫 관문이 된 코딩 인터뷰! 주요 기업에서 실시하는 코딩 테스트의 기출 문제를 분석하고 상세한 문제 풀이와 해설을 통해 취업과 이직에 한발짝 다가서자. 이 책은 현업과 실무에 유용한 주요 알고리즘 이론을 깊숙이 이해하고, 파이썬의 핵심 기능과 문법까지 상세하게 이해할 수 있는 취업용 코딩 테스트를 위한 완벽 가이드다. 이 책을 다 읽고 나면, “왜 알고리즘을 공부하는가?”라는 질문에 대한 해답을 얻을 것이다."
		},
		{
			"title":"CODING BASICS PYTHON (파이썬)",
			"link":"https://search.shopping.naver.com/book/catalog/32440944646",
			"image":"https://shopping-phinf.pstatic.net/main_3244094/32440944646.20221019135252.jpg",
			"author":"김상민^장성식^김일태",
			"discount":"18000",
			"publisher":"렉스미디어닷넷",
			"pubdate":"20220210",
			"isbn":"9788959604210",
			"description":"파이썬으로 다지는 프로그래밍의 기초ㆍ 다양한 예제를 활용하여 초보자도 쉽게 프로그래밍의 기본을 익힐 수 있는 파이썬 입문서입니다.ㆍ 문법을 사전식으로 나열하지 않고 기능적인 프로그램을 하나씩 완성하면서 익힐 수 있게 구성했습니다.ㆍ 단계별로 완성하는 장별 예제 및 연습문제를 바탕으로 자신만의 프로그램을 완성할 수 있습니다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32460987987",
			"image":"https://shopping-phinf.pstatic.net/main_3246098/32460987987.20221019132817.jpg",
			"author":"홍의경",
			"discount":"28800",
			"publisher":"생능출판",
			"pubdate":"20220309",
			"isbn":"9788970506784",
			"description":"코딩 실력을 키우는 지름길은 실습이다.2008년 즈음에 검인정 중학교 교과서 정보1, 정보2, 정보3을 공저로 저술하였습니다. 그 당시에 8종류의 교과서가 검인정에 합격하였는데, 파이썬을 기반으로 하는 교과서가 2종류, C언어를 기반으로 하는 교과서가 2종류, 베이직을 기반으로 하는 교과서가 2종류, 스크래치를 기반으로 하는 교과서가 2종류였습니다.교육용 언어로 시작한 파이썬이 중학교 학생들이 비교적 쉽게 학습할 수 있는 프로그래밍 언어라고 생각했는데 10여년의 세월이 흐른 지금 파이썬이 활용되는 분야가 가히 폭발적으로 증가하였습니다. 파이썬에 관한 쉽고 좋은 교재를 저술하기 위해서 인터넷에서 30,000페이지 이상의 자료를 찾아서 검토하였습니다. 어쩌면 파이썬이 첫 프로그래밍 언어일 본 교재의 독자들이 두려움 없이 파이썬을 기초부터 쉽게 공부하다가, 교재를 다 읽고 나면 “어느새 중급 수준에 도달했구나”라는 생각이 들도록  완성도 높은 교재를 목표로 하였습니다. 입문자를 대상으로 하는 교재일수록 집필하는데 훨씬 더 많은 정성과 노력이 필요하다는 것을 잘 알고 있습니다. 개인적으로는 데이터베이스 전공교재를 저술할 때보다 몇 배 더 힘들었고, 공을 많이 들였습니다. 원고를 버전 9까지 작성하는 동안 셀 수 없이 원고를 읽어보면서 꼭 필요하지 않은 문장은 삭제하고, 필요한 문장은 반드시 넣었습니다. 고등학교 검인정 교과서 1권, 중학교 검인정 교과서 3권, 데이터베이스 전공 교재 2권, 엑셀 교재 1권, 번역서 2권을 집필하면서 나름대로 한글을 정확하고 간결하게 표현하는데 자신이 있습니다."
		},
		{
			"title":"파이썬 (제2판)",
			"link":"https://search.shopping.naver.com/book/catalog/32436240934",
			"image":"https://shopping-phinf.pstatic.net/main_3243624/32436240934.20230117165049.jpg",
			"author":"염기원",
			"discount":"16200",
			"publisher":"북두",
			"pubdate":"20220120",
			"isbn":"9791166750991",
			"description":"책의 전반부는 비전공자의 입장에서 비전공자를 위한 파이썬 프로그래밍의 기초적인 내용으로 구성되어 있다. 프로그래밍에 익숙하거나 파이썬 경험이 있는 독자들은 곧바로 책의 후반부를 공부하는 것을 추천한다. 책의 전반부에서는 저자가 처음 컴퓨터 프로그래밍이라는 것을 배울 때 가장 어려워했던 변수와 메모리 관계, 특성에 대해서 상세하게 설명하면서 비전공자들이 쉽게 프로그래밍에 입문할 수 있도록 하였다. 대부분의 프로그래밍 교재와 다를바 없이, 파이썬으로 프로그램을 작성할 수 있도록 개발환경을 설치하는 과정과 사용 가능한 프로그래밍 툴에 대해서도 빠지지 않고 최대한 상세한 설명과 충분한 그림을 삽입하였다. 또한, 전반부의 뒷부분은 데이터 분석에 필요한 파이썬 프로그램 위주로 구성해서 앞부분의 기초 프로그래밍 지식을 바탕으로 본격적인 데이터 분석을 위한 토대를 마련할 수 있도록 구성하였다."
		},
		{
			"title":"칼퇴하는 일잘러의 업무 스킬, 파이썬 업무 자동화 (엑셀부터 워드·PDF·이메일·웹 크롤링·파일 정리 업무까지)",
			"link":"https://search.shopping.naver.com/book/catalog/36546204619",
			"image":"https://shopping-phinf.pstatic.net/main_3654620/36546204619.20230117163622.jpg",
			"author":"이태화",
			"discount":"22500",
			"publisher":"프리렉",
			"pubdate":"20221226",
			"isbn":"9788965403487",
			"description":"사소하지만 꼭 해야 할 일이 많아 업무 시간이 부족한가요?떼려야 뗄 수 없는 엑셀과 워드 업무부터 PDF, 이메일, 웹 크롤링, 파일 정리 업무까지반복되는 업무는 파이썬에게 맡기고, '나'만이 할 수 있는 업무 능력을 키우세요!업무 시간은 한정적인데 해야 할 일은 산더미인가요? 어렵진 않지만 손이 많이 가는 업무에 시간을 많이 뺏기고 있나요? 그렇다면 파이썬으로 당신의 업무를 자동화하세요. 이 책은 파이썬을 처음 접하는 사람들을 위한 기초부터, 기존의 파이썬 사용자들을 위한 실전 예제까지 모두 담고 있습니다. '도전 업무' 코너를 통해 실제 현업에서 수행하는 업무를 예로 들고, 파이썬을 활용해 이러한 업무를 자동화하는 방법을 설명합니다.특히 이번 개정판에서는 업무에 자주 쓰이는 워드와 PDF 파일을 다루고 파이썬을 통해 자동화하는 방법을 추가하여, 보다 실무에 밀착한 파이썬 업무 자동화를 제시합니다. 또한, 파이썬 초보자나 파이썬에 익숙지 않은 분들이 실수하기 쉬운 부분에 숏츠 영상으로 연결되는 QR 코드를 추가했습니다. QR 코드를 스캔하여 보다 쉽고 깊게 이해하길 바랍니다.칼퇴하고 워라블을 즐기고 싶다면시작하세요, 파이썬 업무 자동화!"
		},
		{
			"title":"SSS급 일잘러를 위한 파이썬과 40개의 작품들 (파이썬을 ’내’ 업무처리 도구로 활용하여 칼퇴하자!)",
			"link":"https://search.shopping.naver.com/book/catalog/35862779618",
			"image":"https://shopping-phinf.pstatic.net/main_3586277/35862779618.20221129164800.jpg",
			"author":"장문철",
			"discount":"19980",
			"publisher":"앤써북",
			"pubdate":"20221120",
			"isbn":"9791197948961",
			"description":"이 책은 파이썬을 내 업무에 활용하여 일처리 시간을 SSS급으로 단축시킬 수 있도록 6가지 주제의 40가지 프로그램을 직접 만들고 내 업무에 바로 응용할 수 있게 구성하였다.이 책은 프로그램 만드는데 꼭 필요한 파이썬 핵심 기초 문법을 떼고 문서작성, 파일 및 폴더 관리, 데이터 수집 및 분석, 이메일 및 다양한 자동 연락, 자동화 및 다양한 업무처리, 이미지 처리 등 업무 관련 프로그램을 직접 코딩해서 만들어 본다. 이 책에서 실습해 보는 40가지 예제를 응용하면 다음과 같은 컴퓨터를 다루는 거의 모든 산업군, 직무군에서 본인의 업무에 맞게 바로 응용해서 일처리 시간을 단축시킬 수 있다.- 일반 사무 및 인사 경리, 유통, 물류, 금융, 이커머스, 영업, 행사 관리, 판매, 통계, 제조, 서비스, 디자인, 관광, 교육기관, 관공서 등 컴퓨터를 다루는 거의 모든 산업군, 직무군이 책의 40가지 프로그램을 만드는 과정에서 오류가 발생하거나 이해되지 않는 부분이 있으면 저자에게 질문할 수 있는 앤써북 독자지원센터 책 전용 게시판을 이용할 수 있다. 책 소스도 전용 게시판에서 다운로드 받을 수 있다. 앤써북 독자지원센터 책 전용 게시판 이용 방법은 책 4~5쪽을 참고한다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32489150082",
			"image":"https://shopping-phinf.pstatic.net/main_3248915/32489150082.20221019142510.jpg",
			"author":"천인국",
			"discount":"11880",
			"publisher":"인피니티북스",
			"pubdate":"20170830",
			"isbn":"9791185578330",
			"description":"컴퓨팅 사고(Computational Thinking)는 자넷 윙 교수가 2006년에 컴퓨터 학술지에서 언급한 이후로 컴퓨터 교육 분야에서 상당한 이슈가 되고 있는 용어이다. 컴퓨팅 사고는 복잡한 문제를 분해하여 문제 안에 내재된 패턴을 찾고 추상화 단계를 거쳐서 문제를 해결하는 알고리즘을 작성하는 과정이다. 작성된 알고리즘은 사람이 수행하거나 컴퓨터를 이용하여 자동화될 수 있다. 이 책은 컴퓨팅 사고와 파이썬을 동시에 학습할 수 있도록 기획되었다. 파이썬은 컴퓨터를 전공하지 않은 학생들도 쉽게 사용할 수 있다는 큰 장점이 있다. 컴퓨팅 사고는 흥미로운 실습 예제가 많이 필요하다. 이 책에서는 최대한 많은 실습 예제를 간추려서 파이썬으로 실습할 수 있도록 하였다. 파이썬은 다양한 애니메이션이나 가상 실습을 만들 수 있는 최적의 도구이다. 학생들은 파이썬을 통하여 컴퓨터 프로그래밍의 기본적인 개념들과 컴퓨팅 사고에서 나타나는 다양한 실습을 수행할 수 있을 것이다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32505098970",
			"image":"https://shopping-phinf.pstatic.net/main_3250509/32505098970.20220527074158.jpg",
			"author":"서정원^김태령",
			"discount":"29000",
			"publisher":"생능출판",
			"pubdate":"20190228",
			"isbn":"9788970509723",
			"description":"이 책은 지금까지 경험하지 못한 코딩 교육의 진수를 보여준다. “코딩 교육이 가야 할 방향은 컴퓨팅 사고력을 높이는 것이다.”라고 이 책의 저자들이 말하듯, “디지털 시대에 적합한 창의력과 문제해결력을 기르기 위한 코딩의 기초부터 응용까지 컴퓨터 코드를 작성하는 것은 물론이고, 알고리즘 학습을 통한 컴퓨팅 사고력을 완전 정복한다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32438172833",
			"image":"https://shopping-phinf.pstatic.net/main_3243817/32438172833.20221019134521.jpg",
			"author":"김영천",
			"discount":"22500",
			"publisher":"기한재",
			"pubdate":"20200225",
			"isbn":"9788970187990",
			"description":"▶ 이 책은 Python(파이썬)을 다룬 이론서입니다. Python(파이썬)의 기초적이고 전반적인 내용을 학습할 수 있습니다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32490271648",
			"image":"https://shopping-phinf.pstatic.net/main_3249027/32490271648.20220527033830.jpg",
			"author":"염기원",
			"discount":"15000",
			"publisher":"복두출판사",
			"pubdate":"20200820",
			"isbn":"9791159069048",
			"description":"비전공자의 데이터 분석을 위한 『파이썬』은 〈파이썬 기초〉, 〈파이썬을 이용한 데이터 분석 기초〉, 〈시각화 라이브러리 사용하기〉 등 파이썬의 기초적이고 전반적인 내용이 수록되어 있다."
		},
		{
			"title":"파이썬 (비전공자를위한 파이썬 기초 입문서)",
			"link":"https://search.shopping.naver.com/book/catalog/32436003648",
			"image":"https://shopping-phinf.pstatic.net/main_3243600/32436003648.20221019110842.jpg",
			"author":"김명호",
			"discount":"16200",
			"publisher":"에듀웨이",
			"pubdate":"20190525",
			"isbn":"9791186179369",
			"description":"막막했던 파이썬, 이제 한 권으로 기초를 배우는파이썬 사용 설명서!전 세계적으로 유명한 구글(Google)이 자신의 많은 서비스를 파이썬으로 제공하고 있습니다. 이것은 구글의 뛰어난 서비스를 개인의 비즈니스에 쉽게 이용할 수 있다는 의미입니다.  이러한 발전에 맞춰 파이썬 문법의 기초를 쉽게 이해할 수 있도록 이 책에서는 친절한 도해와 함께 코딩 개념을 설명합니다. 파이썬을 처음 배우는 학생부터 비전공자, 코딩 실력을 높이려는 직장인까지 기본 문법부터 예제를 통한 활용 실력을 높여 파이썬 프로그래밍을 마스터할 수 있습니다. 가장 쉽고, 빠르게, 효율적인 파이썬 사용 설명서! ‘한 권으로 끝내는 파이썬’에서 찾아보세요."
		},
		{
			"title":"파이썬 (다양한 예제로 알로리즘 쉽게 분석하기)",
			"link":"https://search.shopping.naver.com/book/catalog/32441765959",
			"image":"https://shopping-phinf.pstatic.net/main_3244176/32441765959.20220527045202.jpg",
			"author":"김유진",
			"discount":"22500",
			"publisher":"다본",
			"pubdate":"20190410",
			"isbn":"9791188577255",
			"description":"파이썬은 인터프리터 방식으로 접근이 쉬운 반면 다양한 기능의 라이브러리들이 제공되어 빅 데이터나 머신 러닝, 순수 과학, 웹, GUI 등 다양한 분야에서 사용되고 있다. 또한, 파이썬은 이식성이 높고 모듈 제작이 가능하기 때문에 자주 사용하는 기능을 모듈로 제작하여 해당 기능이 필요할 때마다 작성한 모듈을 임포트(import)하여 사용할 수 있다. 이처럼 많은 장점을 가진 파이썬은 특히 빅 데이터나 머신 러닝, 사물 인터넷, 웹에서 많이 사용되므로 해당 분야와 관련해 취업을 준비하거나 공부하는 학생 그리고 이런 분야와 관련된 일을 하는 개발자들에게 꼭 필요한 프로그램 언어이므로 이 책은 이들에게 좋은 참고서가 될 것이다."
		},
		{
			"title":"파이썬",
			"link":"https://search.shopping.naver.com/book/catalog/32441653441",
			"image":"https://shopping-phinf.pstatic.net/main_3244165/32441653441.20220530153348.jpg",
			"author":"Y. Daniel Liang",
			"discount":"31500",
			"publisher":"에피스테메",
			"pubdate":"20180302",
			"isbn":"9788920028892",
			"description":"이 책은 누구나 쉽게 따라할 수 있는 파이썬 프로그래밍 언어에 기반하고 있기 때문에 프로그래밍을 통해 얻을 수 있는 논리 능력 향상과 문제 해결력 배양에 가장 적합하다. 비전공자도 쉽게 이해하고 활용할 수 있는 풍부한 예제를 제공하여 프로그래밍의 기본 개념 정립에 도움을 주며 실생활과 밀접하게 관련된 다양한 사례 연구를 통해 실생활의 문제 해결 능력을 자연스럽게 배양시킨다. 이 책을 활용한 프로그래밍 학습을 통해 파이썬 프로그램을 스스로 작성하고 실행해 봄으로써 자신만의 프로그램을 작성할 수 있다는 뿌듯함을 느껴볼 수 있다. 객체지향 개념과 그래픽 처리, 이벤트 처리 등이 쉽게 설명되어 있어 복잡하지 않고 간단하게 프로그램에 추가하여 다양한 기능을 가진 자신만의 프로그램도 작성해 볼 수 있다.이 책은 파이썬 언어에 대한 기본 문법부터 활용까지 프로그래밍에 관한 전반적인 내용을 다루고 있고 원저자의 경험과 능력, 치밀한 구성에 의해 완성한 책인 만큼 완성도 및 충실도는 매우 뛰어나다. 그동안 무심코 넘어갔던 개념들에 대해서 다시 한 번 생각해 보는 계기를 마련해 준다. 그만큼 이 책은 파이썬 프로그래밍 언어에 대한 개념과 활용을 집대성했기 때문이다. 그래서 IT 전공자뿐만 아니라 광범위한 분야에서 프로그래밍에 관심 있는 입문자들에게 많은 도움과 개념을 정리해 줄 수 있는 책이다."
		}
	]
}